//
// メッセージ定義
//
module.exports = {
    //common
    'COM_ERR_001':'データの取得に失敗しました',
    'COM_ERR_002':'データの登録に失敗しました',
    'COM_ERR_003':'データの更新に失敗しました',
    'COM_ERR_004':'データの削除に失敗しました',
    'COM_ERR_005':'同一名のものが存在します',
    'COM_ERR_006':'予期せぬエラーが発生しました',
    'COM_INFO_001':'データを登録しました',
    'COM_INFO_002':'データを更新しました',
    'COM_INFO_003':'データを削除しました',

    'AUT_ERR_001':'複数のユーザーが存在しています。データ不正のためデータを確認してください',
    'AUT_ERR_002':'該当するユーザーが存在しません',
    'AUT_WARN_001':'メールアドレスまたはパスワードに誤りがあります',

    //user
    'UER_ERR_001':'既に存在している社員番号です',
    'UER_ERR_002':'既に存在しているメールアドレスです',
    'UER_ERR_003':'対象のユーザーは存在しません',

    
};